[
  {
    "name": "Riyadh",
    "population": "7.6 million",
    "coordinates": "24.7136° N, 46.6753° E",
    "description": "The capital city of Saudi Arabia and a bustling metropolis blending modern architecture with cultural heritage.",
    "highlights": [
      {
        "title": "Date Markets",
        "content": "Home to the largest date markets in the Kingdom, offering a wide variety of premium dates."
      },
      {
        "title": "Modern Facilities",
        "content": "State-of-the-art date processing factories equipped with the latest technology."
      },
      {
        "title": "Cultural Heritage",
        "content": "Experience the rich cultural significance of dates in Saudi tradition and hospitality."
      }
    ]
  },
  {
    "name": "Jeddah",
    "population": "4.2 million",
    "coordinates": "21.5433° N, 39.1728° E",
    "description": "The commercial hub of Saudi Arabia and gateway to the holy cities of Mecca and Medina.",
    "highlights": [
      {
        "title": "Coastal Distribution",
        "content": "Major port for exporting Saudi dates to international markets across the world."
      },
      {
        "title": "Date Festivals",
        "content": "Annual festivals celebrating the date harvest season with cultural exhibitions."
      },
      {
        "title": "Culinary Innovation",
        "content": "Home to innovative chefs creating modern recipes using traditional Saudi dates."
      }
    ]
  },
  {
    "name": "Dammam",
    "population": "1.2 million",
    "coordinates": "26.4367° N, 50.1039° E",
    "description": "The capital of the Eastern Province and home to the famous Khalas dates.",
    "highlights": [
      {
        "title": "Khalas Excellence",
        "content": "Renowned for producing the premium Khalas dates, celebrated for their distinctive flavor."
      },
      {
        "title": "Research Centers",
        "content": "Leading agricultural research facilities focused on date palm cultivation and preservation."
      },
      {
        "title": "Traditional Farms",
        "content": "Visit traditional date farms that have preserved ancient farming techniques for generations."
      }
    ]
  }
]
